tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

tap "d12frosted/emacs-plus"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"

brew "autoconf"
brew "automake"
brew "awk"
brew "bat"
brew "ca-certificates"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "emacs-plus@30"
brew "eza"
brew "fd"
brew "fop"
brew "fx"
brew "fzf"
brew "gcc"
brew "gettext"
brew "git"
brew "git-delta"
brew "hub"
brew "jj"
brew "jq"
brew "lazyjj"
brew "less"
brew "libpq"
brew "luajit"
brew "lsd"
brew "mise"
brew "neovim"
brew "nushell"
brew "openjdk"
brew "openssl@1.1"
brew "openssl@3"
brew "pandoc"
brew "pgcli"
brew "poppler"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup"
brew "shared-mime-info"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "taplo"
brew "thefuck"
brew "tree"
brew "tree-sitter"
brew "uutils-coreutils"
brew "wget"
brew "wxwidgets"
brew "xz"
brew "yamlfmt"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zstd"

brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "jesseduffield/lazygit/lazygit"

cask "font-fira-code"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "github"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "rapidapi"
cask "postgres-unofficial"
cask "postico"
cask "secretive"
cask "visual-studio-code"
cask "vivaldi"
cask "zen-browser"
