tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

tap "d12frosted/emacs-plus"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"

brew "aom"
brew "autoconf"
brew "automake"
brew "awk"
brew "bat"
brew "ca-certificates"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "emacs-plus@30"
brew "eza"
brew "fd"
brew "ffmpegthumbnailer"
brew "fop"
brew "fzf"
brew "gcc"
brew "gdk-pixbuf"
brew "gettext"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "glib"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "harfbuzz"
brew "hub"
brew "imagemagick"
brew "isort"
brew "jpeg-xl"
brew "jq"
brew "krb5"
brew "less"
brew "libheif"
brew "libpq"
brew "libxslt"
brew "libyaml"
brew "luajit"
brew "mise"
brew "neovim"
brew "openjdk"
brew "openjpeg"
brew "openldap"
brew "openssl@1.1"
brew "openssl@3"
brew "pandoc"
brew "pgcli"
brew "poppler"
brew "protobuf"
brew "python@3.12"
brew "ripgrep"
brew "rust-analyzer"
brew "shared-mime-info"
brew "shellcheck"
brew "shfmt"
brew "sqlite"
brew "thefuck"
brew "tree"
brew "tree-sitter"
brew "unar"
brew "unbound"
brew "webp"
brew "wget"
brew "wxwidgets"
brew "xz"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zstd"

brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "jesseduffield/lazygit/lazygit"

cask "discord"
cask "docker"
cask "font-fira-code"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "github"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "rapidapi"
cask "tableplus"
cask "postico"
cask "secretive"
cask "visual-studio-code"
cask "zen-browser"
